
//сервер - это программа которая позволяет запускать сайт и выполнять более сложные манипуляции с ним. Это бэкэнд часть
//локальные сервера позволяют нам тестировать наш продукт у себя на компьютере
//классификация локальных серверов: 
// - простые - выполняют одну единственную задачу или несколько простых liveServer, httpsrver, jsonserver, Browser Sync
// эти сервера умеет обрабатывать несколько видов запросов:
// - http запросы:
 //       - get и post запросы; get - получить информацию; post - отправить информацию
 // простые локальные сервера поддерживают только get запросы, также get запросы не работают на обычных HTML страницах
// - комплексные  - выполняют все что можно только на сервере

//технология AJAX это серверная технология которая позволяет отправлять get и post запросы без перезагрузки страницы

//JSON - современный формат передачи данных JavaScript Object Notation -  является текстовым форматом обмена данных (используется для передачи и хранения данных)
//JSON изначально использовался только в JS, но теперь может использоваться практически любым языком програмирования
//JSON это набор пар ключ-значение как в объекте,и главное правило что все строки должны быть в двойных кавычках, в качестве значений могут быть объекты,
//массивы, числа, строки, логические значения или null, т.о. мы можем получить небольшую нереляционную базу данных

